// 2차원 배열과 포인터
#include <stdio.h>
void main() {
  static a[3][3] = { { 1, 2, 3 }, { 4, 5, 6 }, { 7, 8, -9 } };
  int *pt;
  pt = a[0]; // pt = a;로 해도 동일함
  /* 
    int a[2][3]의 경우
    -----------
    | a[0][0] | <- pt
    -----------
    | a[0][1] | <- pt + 1
    -----------
    | a[0][2] | <- pt + 2
    -----------
    | a[1][0] | <- pt + 3
    -----------
    | a[1][1] | <- pt + 4
    -----------
    | a[1][2] | <- pt + 5
    -----------
  */

  printf("pt = %d\n", pt); // 
  printf("*pt = %d\n", *pt); // 1 -> a[0][0]의 값인 1 출력
  printf("*pt + 10 = %d\n", *pt + 10); // 11 -> a[0][0]의 값인 1에 10 더한 11 출력
  printf("*(pt + 1) = %d\n", *(pt + 1)); // 2 -> a[0][1]의 값인 2 출력

  while(*pt != -9) {
    printf("%d", *pt);
    pt ++;
  }
  // 1 2 3 4 5 6 7 8
}